-- ### 问题清单

-- Q01:查询01课程比02课程成绩高的学生的信息及课程分数


-- Q02:查询01课程比02课程成绩低的学生的信息及课程分数


-- Q03:查询平均成绩大于等于60分的同学的学生编号和学生姓名和平均成绩


-- Q04:查询平均成绩小于60分的同学的学生编号和学生姓名和平均成绩


-- Q05:查询所有同学的学生编号、学生姓名、选课总数、所有课程的总成绩


-- Q06:查询李姓老师的数量


-- Q07:查询学过张三老师授课的同学的信息


-- Q08:查询没学过张三老师授课的同学的信息


-- Q09:查询学过编号为01并且也学过编号为02的课程的同学的信息


-- Q10:查询学过编号为01但是没有学过编号为02的课程的同学的信息


-- Q11:查询没有学全所有课程的同学的信息


-- Q12:查询至少有一门课与学号为01的同学所学相同的同学的信息


-- Q13:查询和01号的同学学习的课程完全相同的其他同学的信息


-- Q14:查询没学过张三老师讲授的任一门课程的学生姓名


-- Q15:查询两门及其以上不及格课程的同学的学号，姓名及其平均成绩


-- Q16:检索01课程分数小于60，按分数降序排列的学生信息


-- Q17:按平均成绩从高到低显示所有学生信息以及的所有课程的成绩以及平均成绩


-- Q18:.查询各科成绩最高分、最低分和平均分：以如下形式显示：课程ID，课程name，最高分，最低分，平均分，及格率，中等率，优良率，优秀率


-- Q19:按各科成绩进行排序，并显示排名


-- Q20:查询学生的总成绩并进行排名


-- Q21:查询不同老师所教不同课程平均分从高到低显示


-- Q22:查询所有课程的成绩第2名到第3名的学生信息及该课程成绩


-- Q23:统计各科成绩各分数段人数：课程编号,课程名称,[100-85],[85-70],[70-60],[0-60]及所占百分比


-- Q24:查询学生平均成绩及其名次


-- Q25:查询各科成绩前三名的记录


-- Q26:查询每门课程被选修的学生数


-- Q27:查询出只有两门课程的全部学生的学号和姓名


-- Q28:查询男生、女生人数


-- Q29:查询名字中含有风字的学生信息


-- Q30:查询同名同性学生名单，并统计同名人数


-- Q31:查询1990年出生的学生名单


-- Q32:查询每门课程的平均成绩，结果按平均成绩降序排列，平均成绩相同时，按课程编号升序排列


-- Q33:查询平均成绩大于等于85的所有学生的学号、姓名和平均成绩


-- Q34:查询课程名称为数学，且分数低于60的学生姓名和分数


-- Q35:查询所有学生的课程及分数情况


-- Q36:查询任何一门课程成绩在70分以上的姓名、课程名称和分数


-- Q37:查询不及格的课程


-- Q38:查询课程编号为01且课程成绩在80分以上的学生的学号和姓名


-- Q39:求每门课程的学生人数


-- Q40:查询选修张三老师所授课程的学生中，成绩最高的学生信息及其成绩


-- Q41:查询不同课程成绩相同的学生的学生编号、课程编号、学生成绩


-- Q42:查询每门功成绩最好的前两名


-- Q43:统计每门课程的学生选修人数（超过5人的课程才统计）。要求输出课程号和选修人数，查询结果按人数降序排列，若人数相同，按课程号升序排列


-- Q44:检索至少选修两门课程的学生学号


-- Q45:查询选修了全部课程的学生信息


-- Q46:查询各学生的年龄


-- Q47:查询本周过生日的学生


-- Q48:查询下周过生日的学生


-- Q49:查询本月过生日的学生


-- Q50:查询下月过生日的学生


